Repository: sanjuli14/cielo_estrellado
Catalog: lib/l10n/app_*.arb
Languages: es

# splashEveryMinute
source: Every Minute Matters
es: Cada Minuto Importa

# splashEveryStar
source: Every Star Counts
es: Cada Estrella Cuenta

# homeActivateFocus
source: Activate your Focus
es: Activa tu Enfoque

# homeLastSession
source: Last session: {duration} min — {stars} stars
es: Última sesión: {duration} min — {stars} estrellas

# homeSessionCompleted
source: Session completed!
es: ¡Sesión completada!

# homeMinutesFocus
source: {minutes} minutes of focus
es: {minutes} minutos de enfoque

# homeStarsGenerated
source: {stars} stars generated
es: {stars} estrellas generadas

# homeShareText
source: Today's sky is complete. Share it with friends
es: El cielo de hoy quedó completo. Compartelo con amigos

# homeSwipeUpStats
source: Swipe up to see statistics
es: Desliza hacia arriba para ver estadisticas

# homeMuteTooltip
source: Mute music
es: Silenciar música

# homeUnmuteTooltip
source: Unmute music
es: Activar música

# homeReminderTooltip
source: Set daily reminder
es: Configurar recordatorio diario

# homeReminderTitle
source: Keep your star streak!
es: ¡Mantén tu racha de estrellas!

# homeReminderBody
source: Come in today so you don't lose your consecutive focus days.
es: Entra hoy para no perder tus días seguidos de enfoque.

# homeReminderSet
source: Streak reminder set at {time}
es: Recordatorio de racha programado a las {time}

# homeReminderDenied
source: Notification permissions denied
es: Permisos de notificación rechazados

# statsTitle
source: Statistics
es: Estadísticas

# statsDailyHours
source: Daily hours (last 7 days)
es: Horas diarias (últimos 7 días)

# statsMonthlyStars
source: Monthly stars
es: Estrellas mensuales

# statsNoData
source: No data available
es: No hay datos disponibles

# statsUnitStars
source: stars
es: estrellas

# constellationUnlocked
source: Unlocked at {stars} stars
es: Desbloqueada a las {stars} estrellas

# notifChannelName
source: Daily Reminders
es: Recordatorios Diarios

# notifChannelDesc
source: Channel for application usage reminders
es: Canal para recordatorios de uso de la aplicación

# onboardingWelcomeTitle
source: Welcome to Focus Night
es: Bienvenido a Focus Night

# onboardingWelcomeDesc
source: Turn your focus time into a beautiful starry sky full of constellations
es: Convierte tu tiempo de enfoque en un hermoso cielo estrellado lleno de constelaciones

# onboardingStarsTitle
source: Generate Stars
es: Genera Estrellas

# onboardingStarsDesc
source: Every second of focus generates 3 stars. Work focused and fill your night sky
es: Cada segundo de enfoque genera 3 estrellas. Trabaja concentrado y llena tu cielo nocturno

# onboardingConstellationsTitle
source: Unlock Constellations
es: Desbloquea Constelaciones

# onboardingConstellationsDesc
source: Accumulate stars to discover 13 beautiful constellations. From Corona Borealis to Ursa Major
es: Acumula estrellas para descubrir 13 hermosas constelaciones. Desde Corona Boreal hasta la Osa Mayor

# onboardingGoalsTitle
source: Set Your Goals
es: Define tus Metas

# onboardingGoalsDesc
source: Set monthly star goals and maintain streaks of consecutive working days
es: Establece objetivos mensuales de estrellas y mantén rachas de días consecutivos trabajando

# onboardingDistractionsTitle
source: Eliminate Distractions
es: Elimina Distracciones

# onboardingDistractionsDesc
source: Block apps that distract you during your deep focus sessions
es: Bloquea aplicaciones que te distraen durante tus sesiones de enfoque profundo

# onboardingProgressTitle
source: Analyze Your Progress
es: Analiza tu Progreso

# onboardingProgressDesc
source: Review detailed charts of your weekly and monthly productivity. Improve continuously
es: Revisa gráficos detallados de tu productividad semanal y mensual. Mejora continuamente

# onboardingSkip
source: Skip
es: Saltar

# onboardingNext
source: Next
es: Siguiente

# onboardingStart
source: Start
es: Comenzar

# splashCopyright
source: Copyright (c) 2026. All rights reserved
es: Copyright (c) 2026. Todos los derechos reservados

# blockerTitle
source: App Blocker
es: Bloqueo de Apps

# blockerUsageTitle
source: 1. Usage Access
es: 1. Acceso de Uso

# blockerUsageDesc
source: We need to know which app you are currently using. Find "Cielo Estrellado" in the list and enable "Allow usage access".
es: Necesitamos saber qué app estás usando actualmente. Busca "Cielo Estrellado" en la lista y activa "Permitir acceso a uso".

# blockerUsageBtn
source: Go to Usage Access
es: Ir a Acceso de Uso

# blockerOverlayTitle
source: 2. Appear on Top
es: 2. Aparecer Encima

# blockerOverlayDesc
source: We need to block the screen when you open a restricted app. Find "Cielo Estrellado" and enable "Allow display over other apps".
es: Necesitamos bloquear la pantalla cuando abras una app prohibida. Busca "Cielo Estrellado" y activa "Permitir mostrar sobre otras apps".

# blockerOverlayBtn
source: Go to Overlay Permission
es: Ir a Permiso de Superposición

# constName_corona_borealis
source: Corona Borealis
es: Corona Boreal

# constDesc_corona_borealis
source: A small and beautiful crown of stars.
es: Una pequeña y hermosa corona de estrellas.

# constDesc_aries
source: The Ram. A small but brave constellation.
es: El Carnero. Una constelación pequeña pero valiente.

# constName_crux
source: Crux
es: Cruz del Sur

# constDesc_crux
source: Emblematic constellation of the southern hemisphere.
es: Constelación emblemática del hemisferio sur.

# constName_scorpius
source: Scorpius
es: Escorpión

# constDesc_scorpius
source: Constellation with a hook shape.
es: Constelación con forma de gancho.

# constName_cygnus
source: Cygnus
es: Cisne

# constDesc_cygnus
source: Also known as the Northern Cross.
es: Conocida también como la Cruz del Norte.

# constDesc_draco
source: The Dragon that winds between the bears.
es: El Dragón que serpentea entre las osas.

# constName_lyra
source: Lyra
es: Lira

# constDesc_lyra
source: Contains Vega, one of the brightest stars.
es: Contiene a Vega, una de las estrellas más brillantes.

# constName_pegasus
source: Pegasus
es: Pegaso

# constDesc_pegasus
source: The Great Square of the winged horse.
es: El Gran Cuadrado del caballo alado.

# constName_leo
source: Leo
es: León

# constDesc_leo
source: One of the oldest constellations of the zodiac.
es: Una de las constelaciones más antiguas del zodíaco.

# constName_andromeda
source: Andromeda
es: Andrómeda

# constDesc_andromeda
source: Chained to Pegasus, it contains the neighboring galaxy.
es: Encadenada a Pegaso, contiene la galaxia vecina.

# constName_orion
source: Orion
es: Orión

# constDesc_orion
source: The Hunter. One of the most recognizable constellations.
es: El Cazador. Una de las constelaciones más reconocibles.

# constName_cassiopeia
source: Cassiopeia
es: Casiopea

# constDesc_cassiopeia
source: The Queen. W shape.
es: La Reina. Forma de W.

# constName_centaurus
source: Centaurus
es: Centauro

# constDesc_centaurus
source: One of the largest and brightest constellations.
es: Una de las constelaciones más grandes y brillantes.

# constName_ursa_major
source: Ursa Major
es: Osa Mayor

# constDesc_ursa_major
source: The Great Bear.
es: El Gran Carro.

# settingsTitle
source: Settings
es: Configuración

# settingsSound
source: Sound
es: Sonido

# settingsMuted
source: Muted
es: Silenciado

# settingsActive
source: Active
es: Activado

# settingsStats
source: Statistics
es: Estadísticas

# settingsStatsDesc
source: Monthly Statistics
es: Estadísticas Mensuales

# settingsNotifs
source: Notifications
es: Notificaciones

# settingsNotifsDesc
source: Set daily reminders
es: Configurar recordatorios diarios

# settingsGoals
source: Personal Goals
es: Metas Personales

# settingsGoalsDesc
source: Configure your objectives
es: Configura tus objetivos

# settingsBlocker
source: App Blocker
es: Bloqueo de Apps

# settingsBlockerDesc
source: Select apps to block
es: Selecciona apps para bloquear

# statsCatalog
source: Constellations Catalog
es: Catálogo de Constelaciones

# statsUnlocked
source: Unlocked!
es: ¡Desbloqueada!

# statsStarsRequired
source: Requires {count} stars
es: Requiere {count} estrellas

# goalsTitle
source: Personal Goals
es: Metas Personales

# goalsYourProgress
source: Your Progress
es: Tu Progreso

# goalsDefineObjectives
source: Define your productivity objectives
es: Define tus objetivos de productividad

# goalsSaveBtn
source: Save Goals
es: Guardar Metas

# goalsSavedSuccess
source: Goals saved successfully
es: Metas guardadas exitosamente

# goalsItemStars
source: ⭐ Stars per month
es: ⭐ Estrellas por mes

# goalsItemStreak
source: 🔥 Consecutive days
es: 🔥 Días seguidos

# goalsHintStars
source: Ex: 100
es: Ej: 100

# goalsUnitStars
source: stars
es: estrellas

# goalsUnitDays
source: days
es: días

# goalsCurrentStreak
source: Current streak: {count} days
es: Racha actual: {count} días

# goalsProgressStars
source: {current} - {target} stars
es: {current} - {target} estrellas

# moonNew
source: New Moon
es: Luna Nueva

# moonWaxingCrescent
source: Waxing Crescent
es: Luna Creciente

# moonFirstQuarter
source: First Quarter
es: Cuarto Creciente

# moonWaxingGibbous
source: Waxing Gibbous
es: Gibosa Creciente

# moonFull
source: Full Moon
es: Luna Llena

# moonWaningGibbous
source: Waning Gibbous
es: Gibosa Menguante

# moonLastQuarter
source: Last Quarter
es: Cuarto Menguante

# moonWaningCrescent
source: Waning Crescent
es: Luna Menguante

# rankStardust
source: Stardust
es: Polvo Estelar

# rankFlicker
source: Wandering Flicker
es: Destello Errante

# rankObserver
source: Star Observer
es: Observador Estelar

# rankGuardian
source: Void Guardian
es: Guardián del Vacío

# rankHunter
source: Nebula Hunter
es: Cazador de Nebulosas

# rankVoyager
source: Intergalactic Voyager
es: Viajero Intergaláctico

# rankMaster
source: Constellation Master
es: Maestro de Constelaciones

# rankArchitect
source: Cosmic Architect
es: Arquitecto del Cosmos

# missionTitle
source: Missions
es: Misiones

# missionDaily
source: Daily
es: Diarias

# missionWeekly
source: Weekly
es: Semanales

# missionMilestones
source: Milestones
es: Hitos

# missionFocus1
source: First Focus
es: Primer Enfoque

# missionFocus1Desc
source: Complete 1 focus session of at least 20 minutes.
es: Completa 1 sesión de al menos 20 minutos.

# missionStars500
source: Stellar Harvest
es: Cosecha Estelar

# missionStars500Desc
source: Collect 500 stars in a single day.
es: Consigue 500 estrellas en un día.
